// export default function() {
//   return {
//     zhdwybh: "", //灾害点唯一编号
//     zhdmc: "", //灾害点名称
//     xmbh: "", //项目编号
//     tfbh: "", //图幅编号
//     tfmc: "", //图幅名称
//     ywbh: "", //野外编号
//     snbh: "", //室内编号
//     xsbh: "", //县市编号
//     s: "", //省
//     xsq: "", //县市区
//     xz: "", //乡镇
//     c: "", //村
//     z: "", //组
//     dlwz: "", //地理位置
//     xzb: "", //X坐标
//     yzb: "", //Y坐标
//     zzb: "", //Z坐标
//     jd: "", //经度
//     wd: "", //纬度
//     cjlx: "", //沉降类型
//     cjzxjd: "", //沉降中心经度
//     cjzxwd: "", //沉降中心纬度
//     fssj: "", //发生时间
//     cjqmj: "", //沉降区面积(km2)
//     npjcj: "", //年平均沉降(mm)
//     lnljcj: "", //历年累计沉降(mm)
//     pjcjsl: "", //平均沉降速率(mm/a)
//     dxdm: "", //地形地貌
//     dzgzhdqk: "", //地质构造及活动情况
//     dcyx: "", //地层岩性
//     hd: "", //厚度(m)
//     jg: "", //结构
//     kjbhgl: "", //空间变化规律
//     swdztz: "", //水文地质特征
//     zycjcw: "", //主要沉降层位
//     nkcl: "", //年开采量(m3/a)
//     nbjl: "", //年补给量(m3/a)
//     dxsms: "", //地下水埋深(m)
//     nswbhfd: "", //年水位变化幅度(m)
//     qt: "", //其它
//     yfcjyy: "", //诱发沉降原因
//     bhgl: "", //变化规律
//     cjxz: "", //沉降现状
//     fzqs: "", //发展趋势
//     zjss: "", //直接损失（万元）
//     swrs: "", //死亡人数（人）
//     zqdj: "A", //灾情等级
//     wxdx: [], //威胁对象
//     qtwxdx: "", //其他威胁对象
//     wxrk: "", //威胁人口（人）
//     wxfw: "", //威胁房屋（户）
//     wxcc: "", //威胁财产（万元）
//     xqdj: "A", //险情等级
//     whdx: [], //危害对象
//     qtwhdx: "", //其他危害对象
//     zywh: "", //主要危害
//     jjss: "", //经济损失（万元）
//     zlcs: "", //治理措施
//     zlxg: "", //治理效果
//     gmdj:"A",
//     szygjyd: 0, //设置遥感解译点
//     szkcd: 0, //设置勘察点
//     szchd: 0, //设置测绘点
//     szgcd: 0, //设置工程点
//     szbqd: 0, //设置搬迁点
//     szyhd: 0, //设置隐患点
//     szfzya: 0, //设置防灾预案
//     ywjlxx: "", //野外记录信息
//     dcfzr: "", //调查负责人
//     tbr: "", //填表人
//     shr: "", //审核人
//     tbrq: "", //填表日期
//     dcdw: "", //调查单位
//     yxh: "", //原序号
//     gxsj: "", //更新时间
//     cjzxwz: "", //沉降中心位置
//     zp: 0, //照片
//     lx: 0, //录像
//     sfhx: 0, //是否核销
//     hxdw: "", //核销单位
//     hxsm: "", //核销说明
//     hxry: "", //核销人员
//     hxsj: "", //核销时间
//     bzsm: "", //备注说明
//     zlly: ""
//   };
// }

export default function() {
  return {
    zhdwybh: "", //灾害点唯一编号
    zhdmc: "", //灾害点名称
    xmbh: "", //项目编号
    tfbh: "", //图幅编号
    tfmc: "", //图幅名称
    ywbh: "", //野外编号
    snbh: "", //室内编号
    xsbh: "", //县市编号
    s: "", //省
    xsq: "", //县市区
    xz: "", //乡镇
    c: "", //村
    z: "", //组
    dlwz: "", //地理位置
    xzb: "", //X坐标
    yzb: "", //Y坐标
    zzb: "", //Z坐标
    jd: "", //经度
    wd: "", //纬度
    cjlx: "", //沉降类型
    cjzxjd: "", //沉降中心经度
    cjzxwd: "", //沉降中心纬度
    fssj: "", //发生时间
    cjqmj: "", //沉降区面积(km2)
    npjcj: "", //年平均沉降(mm)
    lnljcj: "", //历年累计沉降(mm)
    pjcjsl: "", //平均沉降速率(mm/a)
    dxdm: "", //地形地貌
    dzgzhdqk: "", //地质构造及活动情况
    dcyx: "", //地层岩性
    hd: "", //厚度(m)
    jg: "", //结构
    kjbhgl: "", //空间变化规律
    swdztz: "", //水文地质特征
    zycjcw: "", //主要沉降层位
    nkcl: "", //年开采量(m3/a)
    nbjl: "", //年补给量(m3/a)
    dxsms: "", //地下水埋深(m)
    nswbhfd: "", //年水位变化幅度(m)
    qt: "", //其它
    yfcjyy: "", //诱发沉降原因
    bhgl: "", //变化规律
    cjxz: "", //沉降现状
    fzqs: "", //发展趋势
    zjss: "", //直接损失（万元）
    swrs: "", //死亡人数（人）
    zqdj: "A", //灾情等级
    wxdx: [], //威胁对象
    qtwxdx: "", //其他威胁对象
    wxrk: "", //威胁人口（人）
    wxfw: "", //威胁房屋（户）
    wxcc: "", //威胁财产（万元）
    xqdj: "A", //险情等级
    whdx: [], //危害对象
    qtwhdx: "", //其他危害对象
    zywh: "", //主要危害
    jjss: "", //经济损失（万元）
    zlcs: "", //治理措施
    zlxg: "", //治理效果
    gmdj:"A",
    szygjyd: 0, //设置遥感解译点
    szkcd: 0, //设置勘察点
    szchd: 0, //设置测绘点
    szgcd: 0, //设置工程点
    szbqd: 0, //设置搬迁点
    szyhd: 0, //设置隐患点
    szfzya: 0, //设置防灾预案
    ywjlxx: "", //野外记录信息
    dcfzr: "", //调查负责人
    tbr: "", //填表人
    shr: "", //审核人
    tbrq: "", //填表日期
    dcdw: "", //调查单位
    yxh: "", //原序号
    gxsj: "", //更新时间
    cjzxwz: "", //沉降中心位置
    zp: 0, //照片
    lx: 0, //录像
    sfhx: 0, //是否核销
    hxdw: "", //核销单位
    hxsm: "", //核销说明
    hxry: "", //核销人员
    hxsj: "", //核销时间
    bzsm: "", //备注说明
    zlly: ""
  };
}
